[
    {
        "passengerID": 1,
        "grade": "Capitaine",
        "name": "Captain Edward John Smith",
        "age": 62,
        "role": "Commodore, White Star Line",
        "survived": false,
        "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/30/CaptianEdwardSmith.jpg/150px-CaptianEdwardSmith.jpg",
        "description": "In a career that spanned decades, Captain “EJ” Smith saw the evolution of the shipping industry first-hand, as sailing ships were fully replaced by ever-growing steam ships. As a Captain for the illustrious White Star Line he earned a reputation as a steady hand, making the Atlantic crossing regularly, with some passengers only willing to cross so long as he was skipper. He maintained a high-level of confidence in the advanced ships, saying of White Star’s Adriatic: I cannot imagine any condition that would cause the Adriatic to founder. I cannot conceive of any fatal disaster happening to this ship. Modern shipbuilding has reduced that danger to a minimum. On Wednesday April 10th, 1912, White Star’s newest flagship Titanic left port at Southampton under Smith’s command. Despite a near-collision with another ship while leaving the harbor, Titanic’s maiden voyage proceeded for four days without incident. On Sunday, the Captain led the first class church services. Throughout the day, Captain Smith received several ice field warnings from the ship’s marconi wireless operators, but, as was standard practice at the time, maintained course and speed, relying on the lookouts to spot any potential dangers. That Sunday evening April 14th, Captain Smith was invited to dine with the Widener’s – a first class couple of great wealth and distinction – along with several other highly regarded passengers. He excused himself from the dinner party early, and checked in with the bridge crew. After leaving orders to awaken him if there was anything of concern, Smith retired to the Captain’s quarters, secure in the knowledge that, despite the ice warnings they’d received that day, Titanic was the most advanced piece of technology modern shipbuilding could produce.",
        "history": "Cecil Fitzpatrick overheard Captain Smith say they couldn't stay any longer, 'she's going'Harold Bride (and others?) saw Smith jump from the bridge as it went under. Fitzpatrick says he saw Andrews jump with him. He didn't really get interesting until after the iceberg to be honest. He didn't seem to be the best in a real emergency. ",
        "class": "Équipage"
    },
    {
        "passengerID": 2,
        "grade": "Premier Officier",
        "name": "Thomas Andrews Jr.",
        "age": 39,
        "role": "Chief Designer",
        "survived": false,
        "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/eb/Thomas_Andrews_%C3%BCl.jpg/260px-Thomas_Andrews_%C3%BCl.jpg",
        "description": "Thomas Andrews Jr. was a naval architect and shipbuilder who took a leading role in the design and construction of Titanic. Andrews was born into the profession, as his uncle Lord Pirrie, was the principal owner of Belfast shipbuilders Harland & Wolff. Thomas began his career at Harland & Wolff at 16 as a premium apprentice, and continued to work his way up through the ranks, becoming thoroughly acquainted with every stage of shipbuilding before eventually being made Managing Director of the company in 1907. He was a hardworking, dedicated man, who was well-liked by his employees. He had a reputation for taking the safety and comfort of workers seriously, incorporating input from crew into designs. His wife recalled him referring to the shipyard workers as his “pals.” Andrews insisted on being present for the maiden voyage of all new ships, and during Olympic’s first run in 1911 the crew had gifted him with a walking stick they had chipped in to purchase themselves.For Titanic’s maiden voyage, Harland & Wolff sent a team known as the Guarantee Group. Lead by Andrews, this team of experts included representatives from a multitude of disciplines to ensure that everything onboard met Harland & Wolff’s standards of excellence. During the maiden voyage the guarantee group was employed throughout the ship to ensure passenger amenities were in working order, and to repair any incomplete or imperfect details. Despite his dedication to his work, those near him in the first days of the journey recall Andrews speaking often of home, his thoughts turning to his wife, and his young daughter back home in Ireland.",
        "history": "Was known to have told Casoveer and Anderson that even if Titanic broke into three pieces, she still wouldn't founder. Long thought to have last been seen in the first class dining room, he was last seen by (someone) with Captain Smith jumping into the sea.",
        "class": "Équipage"
    },
    {
        "passengerID": 3,
        "grade": "Second Officier",
        "name": "John 'Jack' George Phillips",
        "age": 38,
        "role": "Wiireless Operator",
        "survived": true,
        "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/99/Jack_George_Phillips.jpg/593px-Jack_George_Phillips.jpg",
        "description": "Jack Philips was the son of a draper who was afforded schooling at a young age. In 1902 he began work at the post office where he learned telegraphy. At nearly 20 he began training as a Marconi wireless operator. As a Marconi employee, Jack was posted aboard White Star ships as well as their primary competitor Cunard. He had served aboard Lusitania and Mauretania, the mammoth Cunard ships that had inspired White Star to commission the Olympic-class ships that included Titanic and her sisters. Marconi operators were a tight-knit bunch, and when Jack was hired as senior Marconi operator aboard Titanic, he and junior operator Harold Bride were quick to get along. They spent their days sending and fielding ship-to-ship and ship-to-shore messages. Some official ship business, but others personal messages from passengers. On April 13th, three days into the maiden voyage, Titanic’s wireless system broke down. Despite the Marconi company’s policy that operators were not to attempt repairs at sea, Jack used his off-shift to fix the machine instead of sleeping. That Sunday was spent by Jack and Harold frantically attempting to send the backlog of passenger messages from the day before to the shore station in Cape Race in Newfoundland. Besieged with the backlog of messages going out, the wireless operators were quick to hand incoming ice warnings off to the crew without sparing much time to worry about the contents.",
        "history": "",
        "class": "Équipage"
    },
    {
        "passengerID": 4,
        "grade": "Passager",
        "name": "Violet Constance Jessop",
        "age": 44,
        "role": "Stewardess",
        "survived": true,
        "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3a/Violet_Jessop_in_Voluntary_Aid_Detachment_Uniform_%28cropped%29.jpg/220px-Violet_Jessop_in_Voluntary_Aid_Detachment_Uniform_%28cropped%29.jpg",
        "description": "Violet Jessop was born in Argentina, the eldest child of Irish immigrants. Her childhood was beset by illness. She survived serious sickness as a child only to lose her father when she was 16. The family relocated to England after the loss. Violet’s mother took work while Violet cared for her younger sister and attended convent school. After her difficult childhood, Violet had determined it was her calling to become a nurse. However, when Violet was 21, her mother took ill, and Violet had to leave school to take over as breadwinner for the family, working as an oceanliner stewardess. Violet Jessop was born in Argentina, the eldest child of Irish immigrants. Her childhood was beset by illness. She survived serious sickness as a child only to lose her father when she was 16. The family relocated to England after the loss. Violet’s mother took work while Violet cared for her younger sister and attended convent school. After her difficult childhood, Violet had determined it was her calling to become a nurse. However, when Violet was 21, her mother took ill, and Violet had to leave school to take over as breadwinner for the family, working as an oceanliner stewardess. Violet eventually took a position with White Star Lines, and was soon assigned to the RMS Olympic. Like many other crewmembers, she greatly admired Thomas Andrews, and wrote lovingly of Olympic. Despite being aboard for the collision with the HMS Hawke, she was unfazed and ready to begin the next chapter of her career aboard White Star’s new flagship: Titanic. Violet described the bustle of getting to know a new ship, as well as taking evening walks on the deck, saying 'If the sun did fail to shine so brightly on the fourth day out, and if the little cold nip crept into the air as evening set in, it only served to emphasize the warmth and luxuriousness within. 'Violet eventually took a position with White Star Lines, and was soon assigned to the RMS Olympic. Like many other crewmembers, she greatly admired Thomas Andrews, and wrote lovingly of Olympic. Despite being aboard for the collision with the HMS Hawke, she was unfazed and ready to begin the next chapter of her career aboard White Star’s new flagship: Titanic. Violet described the bustle of getting to know a new ship, as well as taking evening walks on the deck, saying 'If the sun did fail to shine so brightly on the fourth day out, and if the little cold nip crept into the air as evening set in, it only served to emphasize the warmth and luxuriousness within.",
        "history": "Went on to also survive the Britanic crashKnown as 'unsinkable' due to being present at the three major white star disasters",
        "class": "Équipage"
    },
    {
        "passengerID": 5,
        "grade": "Passager",
        "name": "Joseph Bell",
        "age": 47,
        "role": "Chief engineer",
        "survived": false,
        "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6e/JosephBell.jpg/220px-JosephBell.jpg",
        "description": "Joseph Bell was Titanic’s Chief Engineer. Born in 1861 at the family farmstead, Bell was the oldest of four. He found an interest in machines, and took an engineering apprenticeship as an engine fitter. He worked for a well known locomotive manufacturer in Newcastle which had made several notable contributions to Victorian railway innovations.He was hired by White Star Lines in 1885, and served as an engineer aboard several ships before being promoted to Chief Engineer of SS Coptic in 1891. In 1893 he married Maude Bates, the two had four children. The family lived in Ripley until 1911, when Bell took lodging in Belfast with his wife and three-year old son so the other children could continue their schooling uninterrupted, though his oldest son Frank would soon join them in Belfast when he landed an apprenticeship with Harland and Wolff.Though he served as Chief Engineer for the maiden voyage, the plan was for him to hand these duties off to another engineer and return to Belfast to oversee the completion of the final Olympic-class sister: Britannic. It was a routine he had completed numerous times before: after overseeing construction on a ship, Bell would then act as the ship’s first Chief Engineer, taking it on its first few voyages before returning to Belfast to oversee White Star’s next project. He had done the same with oldest sister Olympic: playing a major role in her construction and taking her to sea for her maiden voyage, before handing Chief Engineering duties off to Robert Flemming so that Bell could return to Belfast to complete work on Titanic.",
        "history": "Stayed behind with other engineers to keep the lights on. Some of his men were reported to have been seen on-deck by a survivor, so it is believed that Bell released them, but the lifeboats had all gone by then.",
        "class": "Équipage"
    },
    {
        "passengerID": 6,
        "grade": "Passager",
        "name": "Catherine Jane Wallis",
        "age": 67,
        "role": "Second or third class matron",
        "survived": false,
        "image": "https://www.encyclopedia-titanica.org/files/1/catherine-wallis-titanic-victim-1.jpg",
        "description": "Catherine Wallis was born as Caterhine Moore in 1877 in Southampton. She had two older brothers, and the family called her “Cissie.” Cissie lost her oldest brother Robert when she was 19. She was married in her early 20s to a Southampton beer-brewer named James Wallis, and the couple welcomed their first child in 1899. Four years later, Mrs. Wallace lost her mother shortly before the birth of her second child. Over the next eight years Catherine and James raised four children together, and Catherine was a homemaker. In 1911 tragedy struck the family again, and Catherine lost her husband and her father within one year of each other. As a Southampton native in need of work to support her four children it was natural for Mrs. Wallis to look to the liners constantly coming and going from port for a job. She found employment with White Star Line as an assistant matron with victualling crews. Her oldest child Melita was only twelve when her mother began working at sea, so it is unclear who would look after her own children while Mrs. Wallis was away at her new post as a matron looking after female passengers and families aboard the Titanic.",
        "history": "",
        "class": "Équipage"
    },
    {
        "passengerID": 7,
        "grade": "Passager",
        "name": "Charles Lighttoller",
        "age": 63,
        "role": "Second officer",
        "survived": true,
        "image": "https://upload.wikimedia.org/wikipedia/commons/1/11/CharlesHLightoller.jpg",
        "description": "Charles Herbert Lightoller was an English sailor whose career began at age 13 as an apprentice aboard a sailing ship. He worked aboard ships throughout his teen years and into his 20s on voyages which took him to South America, Australia, India and West Africa. At 24 he decided on a whim to join the gold rush and spent 1898 trekking through the Canadian wilderness in search of claims. Failing to find enough gold to make a living, he tried driving cattle, but soon determined he would have better luck returning to Britain and sailing. Lightoller was made first officer of White Star Line’s newest ship Titanic, and in March of 1912  boarded for her sea trials along with other senior officers William Murdoch and David Blair. He wrote of the ship’s scale: “It is difficult to convey any idea of the size of a ship like the Titanic, when you could actually walk miles along decks and passages, covering different ground all the time.” After Titanic’s sea trials, White Star higher ups decided to bring Olympic’s chief officer Henry Wilde on to serve on Titanic’s maiden voyage, dropping Murdoch and Lightoller both down in rank, and bumping Blair, who was considered too senior to serve as third officer, off the ship entirely. Disappointed, Blair wrote to his sister: 'This is a magnificent ship, I feel very disappointed I am not to make her first voyage.'' ",
        "history": "Née à Worms, en Allemagne, Ida a épousé Isidor Straus en 1871. Le couple était connu pour leur dévotion mutuelle. Pendant le naufrage du Titanic, Ida a refusé de quitter son mari et tous deux ont choisi de rester à bord, périssant ensemble.",
        "class": "Équipage"
    },
    {
        "passengerID": 8,
        "grade": "Passager",
        "name": "Frederick William Hopkins",
        "age": 46,
        "role": "Plate steward",
        "survived": false,
        "image": "https://www.encyclopedia-titanica.org/images/fred_hopkins_H.jpg",
        "description": "Fred Hopkins was a young Englishman from Aldershot in England who worked as a plate steward aboard the Titanic. Not yet 15 years old when he signed on to the Titanic’s crew, Fred was one of the youngest crew members onboard. When he registered for service he listed his age as 16, perhaps attempting to appear as a seasoned adult of 16 by padding his life-experience with a few years.  Before taking to the sea for paying work, Fred was prolific Boy Scout who was very popular in his Troop. As a First-Class Scout he had been elevated to become a patrol leader and had earned the badges needed to receive his King’s Badge – the highest award a Scout could receive in the British Commonwealth. He had a fondness for swimming, and had taken life-saving and swimming certifications. The summer before he joined Titanic’s crew, he had even kept a distressed swimmer from drowning, a deed which he considered his duty. ",
        "history": "Guggenheim est né à Philadelphie, Pennsylvanie, et faisait partie de la famille éminente des Guggenheim. Il voyageait sur le Titanic avec son valet et sa maîtresse. Connu pour sa chevalerie pendant la catastrophe, il s'est habillé de ses plus beaux vêtements et a accepté son sort avec dignité, déclarant qu'il était 'prêt à descendre comme un gentleman.'",
        "class": "Équipage"
    },
    {
        "passengerID": 9,
        "grade": "Passager",
        "name": "Frederick Barrett",
        "age": 49,
        "role": "Leading stoker",
        "survived": true,
        "image": "https://upload.wikimedia.org/wikipedia/commons/0/0f/Frederick_William_Barrett.jpg",
        "description": "Frederick Barrett was a 29 year-old laborer from the north of England. He took to the sea, and was crewing ships as early as 1903. By 1912, with years of experience behind him, Barrett was brought on as a leading stoker aboard Titanic, taking charge of a boiler room with a team of 10-15 firemen working under him. Keeping the boilers lit on steam engines was the responsibility of teams of men called stokers (firemen), and trimmers. The stokers, or firemen, were assigned three furnaces at a time, spending their four hour shifts shoveling coal. Trimmers moved coal throughout the ship, not only transporting it to the firemen for use in the boiler, but maneuvering the stored coal throughout the ship to maintain weight distribution. Each section was under the supervision of leading firemen, or Stoker Foremen The boiler crew worked in three shifts, of four hour watches, with eight hours between shifts to recover from the blistering temperatures and backbreaking work in the boilers. At 11:40 PM on Sunday the 14th of April Barrett was working in boiler room 6, nearing the end of his second 8-12 shift of the day, and he and the rest of his crew were likely looking forward to their hard-earned shift break and escaping the stiflingly hot boiler rooms.",
        "history": "Ismay est né à Crosby, en Angleterre, et a joué un rôle clé dans la conception et la construction du Titanic. Il a survécu controversée de la catastrophe en montant à bord d'un canot de sauvetage, ce qui a conduit à de nombreuses critiques publiques et médiatiques. Après le naufrage, Ismay s'est retiré des affaires actives et a mené une vie tranquille jusqu'à sa mort.",
        "class": "Équipage"
    },
    {
        "passengerID": 10,
        "grade": "Passager",
        "name": "Charles Joughin",
        "age": 39,
        "role": "Chief Baker",
        "survived": false,
        "image": "https://www.encyclopedia-titanica.org/images/charles_joughin_1912_P.jpg",
        "description": "Charles Joughin was the chief baker aboard Titanic. At age 33 he had already been a baker at sea for ten years, and had previously been a member of the victualling crew aboard Titanic’s sister ship Olympic. Born in Birkenhead, England just across the River Mersey from Liverpool. His father was in food service as a licensed victualler. This combined with being born and raised in a port town likely influenced Joughin’s chosen career as a member of victualling crews aboard ships. When Joughin was eight years old, his father died, leaving his mother to support the family. She began nursing and later managed a coffee shop. It was only three years later that Joughin took on work at age eleven, perhaps to ease the financial burden on his mother.Joughin spent years working on various ships’ victualling crews. He’d been aboard several White Star ships, including Majestic, Teutonic, and Olympic. He was working aboard the Titanic for her delivery trip from Belfast to Southampton in early April 1912 and he was offered the job of chief baker, where he would supervise a staff of 13. ",
        "history": "Andrews est né à Comber, dans le comté de Down, en Irlande, et était membre de la société de construction navale Harland and Wolff. Il était à bord du Titanic pour observer son voyage inaugural et fournir un soutien. Pendant le naufrage, Andrews a été vu aidant les passagers et les incitant à monter dans les canots de sauvetage. Il n'a pas survécu à la catastrophe.",
        "class": "Équipage"
    },
    {
        "passengerID": 11,
        "grade": "Passager",
        "name": "Frederick Fleet",
        "age": 22,
        "role": "Lookout",
        "survived": true,
        "image": "https://www.encyclopedia-titanica.org/files/1/fleet-frederick.jpg",
        "description": "Abandoned by mother, foster families",
        "history": "Née à Hoboken, New Jersey, Gibson voyageait sur le Titanic avec sa mère. Elle a survécu à la catastrophe et a ensuite joué dans un film sur le naufrage, 'Saved from the Titanic', qui est sorti juste un mois après l'événement. Le film est considéré comme le premier film réalisé sur le Titanic.",
        "class": "Équipage"
    },
    {
        "passengerID": 12,
        "grade": "Passager",
        "name": "Arthur John Priest",
        "age": 7,
        "role": "Fireman",
        "survived": true,
        "image": "",
        "description": "",
        "history": "",
        "class": "Équipage"
    },
    {
        "passengerID": 13,
        "grade": "Passager",
        "name": "Harold Sydney Bride",
        "age": 18,
        "role": "Wireless operator",
        "survived": "",
        "image": "",
        "description": "",
        "history": "",
        "class": "Équipage"
    },
    {
        "passengerID": 14,
        "grade": "Passager",
        "name": "Abert Ervine",
        "age": 34,
        "role": "Engineer",
        "survived": true,
        "image": "",
        "description": "",
        "history": "",
        "class": "Équipage"
    },
    {
        "passengerID": 15,
        "grade": "Passager",
        "name": "John Starr March",
        "age": 19,
        "role": "Mail Clerk",
        "survived": "",
        "image": "",
        "description": "",
        "history": "",
        "class": "Équipage"
    },
    {
        "passengerID": 16,
        "grade": "Passager",
        "name": "Hugh Walter McElroy",
        "age": 54,
        "role": "Purser",
        "survived": "",
        "image": "",
        "description": "",
        "history": "",
        "class": "Équipage"
    },
    {
        "passengerID": 17,
        "grade": "Passager",
        "name": "Joseph Dawson",
        "age": 24,
        "role": "Trimmer",
        "survived": "",
        "image": "",
        "description": "",
        "history": "",
        "class": "Équipage"
    },
    {
        "passengerID": 18,
        "grade": "Passager",
        "name": "Eugene Daly",
        "age": 22,
        "role": "",
        "survived": "",
        "image": "",
        "description": "",
        "history": "",
        "class": "Équipage"
    },
    {
        "passengerID": 19,
        "grade": "Passager",
        "name": "Arthur Barrat",
        "age": 25,
        "role": "",
        "survived": "",
        "image": "",
        "description": "",
        "history": "",
        "class": "Équipage"
    },
    {
        "passengerID": 20,
        "grade": "Passager",
        "name": "Dr. O'Laughlin",
        "age": 24,
        "role": "",
        "survived": "",
        "image": "",
        "description": "",
        "history": "",
        "class": "Équipage"
    },
    {
        "passengerID": 21,
        "grade": "Passager",
        "name": "Luigi Gatti",
        "age": 5,
        "role": "",
        "survived": "",
        "image": "",
        "description": "",
        "history": "",
        "class": "Équipage"
    },
    {
        "passengerID": 22,
        "grade": "Passenger",
        "name": "Eleanor Elkins Widener",
        "age": 50,
        "role": "Passenger",
        "survived": true,
        "image": "",
        "description": "Eleanor Elkins Widener was a Philadelphia socialite and Titanic survivor.",
        "history": "Widener was born in Philadelphia, Pennsylvania, and was returning from a European trip with her family. Her husband and son perished in the disaster, but Eleanor survived and later donated a library to Harvard University in their memory.",
        "class": "First Class"
    },
    {
        "passengerID": 23,
        "grade": "Passenger",
        "name": "Robert Hichens",
        "age": 29,
        "role": "Quartermaster",
        "survived": true,
        "image": "",
        "description": "Robert Hichens was a British sailor and Titanic quartermaster.",
        "history": "Hichens was born in Newlyn, Cornwall, England, and was at the helm when the Titanic struck the iceberg. He was responsible for lifeboat 6 and became infamous for his treatment of passengers during the evacuation. After the disaster, he continued his maritime career but struggled with personal issues and was imprisoned for attempted murder in later life.",
        "class": "Staff"
    },
    {
        "passengerID": 24,
        "grade": "Passenger",
        "name": "Edith Corse Evans",
        "age": 36,
        "role": "Passenger",
        "survived": false,
        "image": "",
        "description": "Edith Corse Evans was an American socialite and Titanic passenger.",
        "history": "Evans was born in Philadelphia, Pennsylvania, and was traveling on the Titanic with friends. She is remembered for giving up her spot in a lifeboat to another woman, a decision that led to her perishing in the disaster. Her sacrifice was later commemorated by her family.",
        "class": "First Class"
    },
    {
        "passengerID": 25,
        "grade": "Passenger",
        "name": "Charlotte Collyer",
        "age": 31,
        "role": "Passenger",
        "survived": true,
        "image": "",
        "description": "Charlotte Collyer was a British Titanic survivor.",
        "history": "Collyer was born in England and was traveling to America with her husband and daughter. Her husband did not survive, but Charlotte and her daughter were rescued. She wrote about her experiences for several publications, providing valuable firsthand accounts of the disaster.",
        "class": "Second Class"
    },
    {
        "passengerID": 26,
        "grade": "Passenger",
        "name": "Joseph Laroche",
        "age": 25,
        "role": "Passenger",
        "survived": false,
        "image": "",
        "description": "Joseph Laroche was a Haitian engineer and Titanic passenger.",
        "history": "Laroche was born in Cap-Haitien, Haiti, and was traveling with his pregnant wife and two daughters. He was the only black passenger in first class. His family survived, but Joseph perished in the disaster. His story was largely forgotten until the late 20th century.",
        "class": "Second Class"
    },
    {
        "passengerID": 27,
        "grade": "Passenger",
        "name": "Anna Sophia Turja",
        "age": 18,
        "role": "Passenger",
        "survived": true,
        "image": "",
        "description": "Anna Sophia Turja was a Finnish-American survivor of the Titanic disaster.",
        "history": "Turja was born in Oulainen, Finland, and was immigrating to the United States to join her sister. She survived the sinking and later settled in Minnesota. Anna lived a long life and shared her experiences in several interviews before her death in 1982.",
        "class": "Third Class"
    },
    {
        "passengerID": 28,
        "grade": "Passenger",
        "name": "Marian Thayer",
        "age": 39,
        "role": "Passenger",
        "survived": true,
        "image": "",
        "description": "Marian Thayer was an American socialite and Titanic survivor.",
        "history": "Thayer was born in Philadelphia, Pennsylvania, and was traveling with her husband and son. Her husband perished, but Marian and her son survived. She later dedicated herself to charitable work and lived in Haverford, Pennsylvania, until her death.",
        "class": "First Class"
    },
    {
        "passengerID": 29,
        "grade": "Passenger",
        "name": "Noel Leslie",
        "age": 39,
        "role": "Countess of Rothes",
        "survived": true,
        "image": "",
        "description": "Noel Leslie, Countess of Rothes, was a British aristocrat and Titanic survivor.",
        "history": "Leslie was born in London, England, and was traveling with her cousin on the Titanic. She played a key role in helping other passengers and managing lifeboat 8. After the disaster, Leslie was praised for her bravery and compassion.",
        "class": "First Class"
    },
    {
        "passengerID": 30,
        "grade": "Passenger",
        "name": "Annie Moore",
        "age": 15,
        "role": "Passenger",
        "survived": true,
        "image": "",
        "description": "Annie Moore was a third-class passenger on the RMS Titanic.",
        "history": "Moore was born in Ireland and was traveling with her family to the United States. She survived the disaster and settled in New York. Annie later married and had a large family. She lived a quiet life and passed away in 1960.",
        "class": "Third Class"
    },
    {
        "passengerID": 31,
        "grade": "Passenger",
        "name": "Edith Eileen Brown",
        "age": 15,
        "role": "Passenger",
        "survived": true,
        "image": "",
        "description": "Edith Eileen Brown was a British Titanic survivor.",
        "history": "Brown was born in Cape Town, South Africa, and was traveling with her parents. Her father perished, but Edith and her mother survived. She later married and shared her experiences of the Titanic with various media outlets before her death in 1997.",
        "class": "Second Class"
    },
    {
        "passengerID": 32,
        "grade": "Passenger",
        "name": "William Carter",
        "age": 36,
        "role": "Passenger",
        "survived": true,
        "image": "",
        "description": "William Carter was an American businessman and Titanic survivor.",
        "history": "Carter was born in Philadelphia, Pennsylvania, and was traveling with his family. He survived the disaster and later returned to his business ventures. William became known for his extensive collection of antique cars and continued to travel widely until his death.",
        "class": "First Class"
    },
    {
        "passengerID": 33,
        "grade": "Passenger",
        "name": "Helen Churchill Candee",
        "age": 53,
        "role": "Passenger",
        "survived": true,
        "image": "",
        "description": "Helen Churchill Candee was an American author, journalist, interior decorator, and Titanic survivor.",
        "history": "Candee was born in New York City and was traveling back to the United States after completing a book. She survived the disaster and continued her writing career. Helen later published several works and became an advocate for women's rights.",
        "class": "First Class"
    },
    {
        "passengerID": 34,
        "grade": "Passenger",
        "name": "William Mintram",
        "age": 46,
        "role": "Passenger",
        "survived": false,
        "image": "",
        "description": "William Mintram was a British Titanic passenger.",
        "history": "Mintram was born in England and was traveling to America for work. He did not survive the sinking, and his body was never recovered. William's family in England mourned his loss and remembered him as a devoted husband and father.",
        "class": "Third Class"
    },
    {
        "passengerID": 35,
        "grade": "Passenger",
        "name": "Hudson Allison",
        "age": 30,
        "role": "Passenger",
        "survived": false,
        "image": "",
        "description": "Hudson Allison was a Canadian businessman and Titanic passenger.",
        "history": "Allison was born in Montreal, Quebec, and was traveling with his family. He did not survive the disaster, but his wife and daughter were rescued. Hudson's loss was deeply felt by his family and business associates.",
        "class": "First Class"
    },
    {
        "passengerID": 36,
        "grade": "Passenger",
        "name": "Alice Cleaver",
        "age": 22,
        "role": "Nanny",
        "survived": true,
        "image": "",
        "description": "Alice Cleaver was a nanny and Titanic survivor.",
        "history": "Cleaver was born in London, England, and was traveling as a nanny for the Allison family. She managed to save the youngest Allison child, Trevor, by taking him into a lifeboat. Alice's actions were later recognized as heroic, and she continued her work as a nanny after the disaster.",
        "class": "First Class"
    },
    {
        "passengerID": 37,
        "grade": "Passenger",
        "name": "Thomas Millar",
        "age": 33,
        "role": "Passenger",
        "survived": false,
        "image": "",
        "description": "Thomas Millar was an Irish Titanic passenger.",
        "history": "Millar was born in Belfast, Ireland, and was traveling to America to start a new life. He did not survive the sinking, and his body was never recovered. Thomas's family in Ireland remembered him as a hardworking and hopeful man.",
        "class": "Third Class"
    },
    {
        "passengerID": 38,
        "grade": "Passenger",
        "name": "Michel Navratil",
        "age": 31,
        "role": "Passenger",
        "survived": false,
        "image": "",
        "description": "Michel Navratil was a French Titanic passenger.",
        "history": "Navratil was born in Slovakia and was traveling with his two sons under the alias 'Louis M. Hoffman.' He did not survive the disaster, but his sons were rescued and later reunited with their mother in France. Michel's story was later uncovered through the efforts of his surviving family.",
        "class": "Second Class"
    },
    {
        "passengerID": 39,
        "grade": "Passenger",
        "name": "Edith Rosenbaum",
        "age": 32,
        "role": "Passenger",
        "survived": true,
        "image": "",
        "description": "Edith Rosenbaum was an American fashion buyer and Titanic survivor.",
        "history": "Rosenbaum was born in Cincinnati, Ohio, and was returning to the United States after a business trip. She survived the disaster and later became known for her work in the fashion industry. Edith's experiences on the Titanic were later recounted in various interviews and documentaries.",
        "class": "First Class"
    },
    {
        "passengerID": 40,
        "grade": "Passenger",
        "name": "Henry Harper",
        "age": 48,
        "role": "Passenger",
        "survived": true,
        "image": "",
        "description": "Henry Harper was an American publisher and Titanic survivor.",
        "history": "Harper was born in New York City and was traveling with his wife and a dog. He survived the disaster and later recounted his experiences in several publications. Henry continued his work in the publishing industry and remained a prominent figure in New York society.",
        "class": "First Class"
    }
]